Repository: jbzdak/data-base-checker
Catalog: grading/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Grade
pl: Ocena:

source: Grade description
pl: Opis do Oceny:

source: If short description is set you should also set grade
pl: Kiedy ustawias opis oceny, powinieneś również wystawić ocenę

source: Submitted file
pl: Wysyłany plik

source: File contents are different than expected
pl: Zawartość pliku jest inna niż oczekiwana

source: File is to large to be graded, this submission allows maximum of {max_size} bytes
pl: Plik jest zbyt duży by był oceniany, w tym miejscu możesz załączyć pliki nie większe niż {max_size}bajtów

source: Content comparator returned following diff : {diff}
pl: Porównywarka zawartości zwróciła taką różnicę pomiędzy oczekiwanym plikiem a plikiem otrzymanym: {diff}

source: Query contained illegal SQL: {}
pl: Zapytanie zawiera nielegalne słowa kluczowe: {}

source: Column metadata is different for model query and your query.
pl: Zazwy kolumn zapytania są inne niż dla zapytania modelowego

source: There is an syntactic error in your sql code.
pl: Twoje zapytanie zawiera błąd składniowy

source: Exception details are: {}
pl: Detale wyjątku to: {}

source: You did not use word '{}' which is required
pl: Nie użyłeś słowa kluczowego: '{}', słowo to jest wymagane.

source: You did use word '{}' which is forbidden
pl: Użyłeś słowa kluczowego: '{}' które jest zakazane

source: You must use at least {expected} subselects, I detected you used {used}
pl: Musisz użyć co najmniej {expected} pod zapytań, według mnie użyłeś: {used}

source: You used a subselect which is forbidden
pl: Użyłeś podzapytania, co jest zakazane!

source: Query returned invalid results
pl: Zapytanie zwróciło niepoprawne wyniki

source: Following entries were invalid: {}
pl: Podane wartości były niepoprawne: {}

source: No grade parts assigned to activity
pl: W tej aktywności nie przypisano jeszcze zadań

source: Some required tasks were missing or grade was to low, these tasks were {}
pl: Niektóre z wymaganych zadań nie zostały wykonane, lub ocena z nich uzyskana była zbyt niska. Tymi zadaniami były: {}.

source: Grade was calculated as weighted average of parts
pl: Ocena została obliczona jako średnia ważona części

source: Default grade after student/activity creation
pl: Domyślna ocena po utorzeniu studenta lub aktywności

source: Change user
pl: Zmień użytkownika

source: Activity %(name)s
pl: Aktywność: %(name)s

source: Currently you have <strong>passed</strong> this activity with grade %(grade)s.
pl: Udało Ci się <strong>zaliczyć</strong> tą aktywność z oceną: %(grade)s.

source: Curently you fail this activity with grade %(grade)s. <br> <small><strong>Details:</strong>%(desc)s</small>
pl: Nie udało Ci się zaliczyć tej aktywności, otrzymujesz ocenę:%(grade)s.<small><strong>Szczegóły:</strong>%(desc)s</small>

source: Elements in this activity
pl: Zadania w tej aktywności

source: List is empty
pl: Lista jest pusta

source: Return to activity
pl: Powróć do aktywności

source: Perform this activity again
pl: Wykonaj tą aktywność ponownie

source: Now grading: "%(name)s"
pl: Teraz oceniamy: "%(name)s"

source: Submit!
pl: Wyślij!

source: Part "%(name)s"
pl: Zadanie: "%(name)s"

source: This task is already graded, you got: <strong>%(grade)s.</strong>
pl: To zadanie jest już ocenione! Otrzymałeś: <strong>%(grade)s.</strong>

source: Can't perform grading now
pl: Nie można teraz odenić tego zadania!

source: Attempt list
pl: Lista prób

source: Attempt at %(date)s result: %(grade)s, description: %(desc)s
pl: Próba z %(date)s ocena: %(grade)s, opis: %(desc)s

source: Details
pl: Szczegóły

source: Course %(name)s
pl: Kurs %(name)s

source: Student Grades
pl: Oceny studentów

source: Mark for %(name)s
pl: Ocena za %(name)s

source: Final grade for %(activity)s
pl: Ocena sumaryczna z aktywności: %(activity)s

source: Displaying grades for %(student)s
pl: Wyświetlamy oceny dla %(student)s

source: Activity: %(name)s grade: %(grade)s
pl: Aktywność: %(name)s ocena: %(grade)s
